app/controllers/omniauth_callbacks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "google_oauth2"], ["uid", "111343682219747795126"], ["LIMIT", 1]]
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$12$K9exaRq3Dp5xTIWSJyP7yeZpS3B7grWVIP8q/9IYh6WbxDVawTJOG"], ["updated_at", "2021-06-28 11:47:28.414916"], ["id", 2]]
---
  def google_oauth2
    auth = request.env["omniauth.auth"]
    user = User.where(provider: auth["provider"], uid: auth["uid"])
            .first_or_initialize(email: auth["info"]["email"])
    #user.name ||= auth["info"]["name"]
    generated_password = Devise.friendly_token.first(8)
    user.password = generated_password
    user.save!